The  DuctSizeSettingIterator  type exposes the following members.
 Properties
Name  |   Description
Current
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  DuctSizeSettingIterator Class
  Autodesk.Revit.DB.Mechanical Namespace